<?php
//$lang[''] = '';

$lang['add'] = 'Добавить систему';
$lang['edit'] = 'Изменить систему';
$lang['adds'] = 'Добавление системы';
$lang['edits'] = 'Изменение системы';
$lang['nid'] = 'ID Системы (только a-z)';
$lang['nida'] = 'ID Системы';
$lang['name'] = 'Название';
$lang['percent'] = 'Проценты';
$lang['format'] = 'Формат вывода (PHP)';

$lang['zakr'] = 'Закрыть';
$lang['kdd'] = 'Система добавлена';
$lang['kedd'] = 'Система изменена';

$lang['knbp'] = 'Название не может быть пустым';
$lang['xnmbp'] = 'ID Системы не может быть пустым';
$lang['vxyes'] = 'ID Системы уже есть';
$lang['nidza'] = 'ID Системы может быть только символы A-Za-z';
$lang['knbpa'] = 'Проценты не могут быть пустыми';
$lang['knbpaz'] = 'Проценты могут быть только символы 0-9';
$lang['knbpaq'] = 'Название максимальная длина 125 символов';
$lang['nidzaq'] = 'ID Системы максимальная длина 8 символов';
$lang['knbpaa'] = 'Проценты максимальная длина 2 символа';
$lang['dzsnp'] = 'Добавление записи сейчас невозможно, попробуйте позже.';
$lang['knbpafa'] = 'Формат вывода не может быть пустым';
$lang['knbpafz'] = 'В формате вывода есть ошибки';

$lang['format_info'] = 'Переменные формата вывода';

$lang['delyb']  = 'Действительно удалить?';



// Конец Права доступа

?>
