<?php
//$lang[''] = '';

$lang['add'] = 'Добавить';
$lang['adds'] = 'Добавить клиента';
$lang['edit'] = 'Измененить';
$lang['edits'] = 'Изменениние';
$lang['name'] = 'Название';
$lang['days'] = 'Срок ключей';
$lang['enable'] = 'Включен';
$lang['server'] = 'Сервер';
$lang['cadegc'] = 'Не удаеться создать ключи';
$lang['dzsnp'] = 'Добавление записи сейчас невозможно, попробуйте позже.';
$lang['autocheck'] = 'Не переключать на приоритеты';
$lang['autoprio'] = 'Автоматически по приоритетам';
$lang['asdqwe'] = 'Невозможно без выбора сервера';

$lang['connect'] = 'Подключен';
$lang['connection'] = 'Подключение';
$lang['disconnect'] = 'Отключен';

$lang['nip'] = 'Внутрений IP';
$lang['rip'] = 'Реальный IP';
$lang['sent'] = 'Получено';
$lang['received'] = 'Отправлено';
$lang['data'] = 'Дата подключения';

$lang['times'] = 'Обновление данных не чаще чем раз в 2 минуты.';
$lang['timez'] = 'До обновления: ';

$lang['desc'] = 'Описание';

$lang['regenerate'] = 'Пересоздать все ключи';

$lang['download'] = 'Загрузка';


// Конец Права доступа

?>
