<?php
//$lang[''] = '';

$lang['abot'] = 'Все боты';
$lang['poibot'] = 'Поиск бота';
$lang['config'] = 'Конфиги';
$lang['gall'] = 'График все';
$lang['glive'] = 'График живые';
$lang['gos'] = 'График ОС';
$lang['gab'] = 'График АВ';
$lang['gri'] = 'График Прав';
$lang['pref'] = 'Префикс';
$lang['sortco'] = 'Сортировка на странице';
$lang['stan'] = 'Стандартная';
$lang['poimsv'] = 'По имени страны (по возрастанию)';
$lang['poimsy'] = 'По имени страны (по убыванию)';
$lang['pkvbv'] = 'По колличеству всех ботов (по возрастанию)';
$lang['pkvby'] = 'По колличеству всех ботов (по убыванию)';
$lang['pkjbv'] = 'По колличеству живых ботов (по возрастанию)';
$lang['pkjy'] = 'По колличеству живых ботов (по убыванию)';
$lang['upda'] = 'Обновить';
$lang['msns'] = 'Максимально стран на странице';
$lang['vcou'] = 'Всего стран';
$lang['country'] = 'Страна';
$lang['kolbot'] = 'Количество ботов';
$lang['livebot'] = 'Живых ботов';
$lang['dyvbs'] = 'Действительно удалить всех ботов в стране ';
$lang['delet'] = 'Удалить';
$lang['evbs'] = 'Удалить всех ботов страны';
$lang['vsycbys'] = 'Всего (на данной странице / на всех страницах)';
$lang['tasks'] = 'Задания';
$lang['blc'] = 'Список стран';

$lang['maip'] = 'Маска IP';
$lang['mikci'] = 'Можно искать как четко IP так и по маске.\nПример: 127.0.0.1 или 127.0.0.';
$lang['jbot'] = 'Жизнь бота от (в мин)';
$lang['jbotv'] = 'Жизнь бота от текущего времени';
$lang['jbdo'] = 'Жизнь бота до (в мин)';
$lang['jbdtv'] = 'Жизнь бота до текущего времени';
$lang['dpjb'] = 'Дата для полей "Жизнь бота"';
$lang['kdydpjb'] = 'Какую дату учитывать для полей Жизнь бота';
$lang['posl'] = 'Последняя';
$lang['perv'] = 'Первая';
$lang['sort'] = 'Сортировка';
$lang['pkpv'] = 'Последний коннект по возрастанию';
$lang['pkvy'] = 'Последний коннект по убыванию';
$lang['pekpv'] = 'Первый коннект по возрастанию';
$lang['pekvy'] = 'Первый коннект по убыванию';
$lang['mbns'] = 'Максимально ботов на странице';
$lang['vsbo'] = 'Всего ботов';
$lang['ip'] = 'IP';
$lang['posken'] = 'Последний коннект';
$lang['dyb'] = 'Действительно удалить бота';
$lang['nksc'] = 'Назад к списку стран';
$lang['allcountr'] = 'Все страны';

$lang['mambcs'] = 'Подсчет страниц в этом режиме не ведется, ботов может быть больше чем показано';
$lang['mapref'] = 'Маска префикса';
$lang['mpmstbla'] = 'Маска префикса может содержать только буквы латинского алфавита.';
$lang['mamb'] = 'Мульти поиск';
$lang['mambs'] = 'Стандартный поиск';
$lang['mambl'] = 'Мульти поиск, каждая строка это полный уид бота вместе с префиксом.';
$lang['mauid'] = 'Маска уида';
$lang['mymsblaic'] = 'Маска уида может содержать буквы латинского алфавита и цифры.';
$lang['mapro'] = 'Маска процесса';
$lang['sleje'] = 'Слежение';
$lang['neyc'] = 'Не учитывать';
$lang['vikl'] = 'Выключено';
$lang['vkl'] = 'Включено';
$lang['typoi'] = 'Тип поиска';
$lang['dlk'] = 'Дать личную команду';
$lang['ipsisplk'] = 'Использовать поле ссылки или сделать пустую личную команду';
$lang['poluid'] = 'Полный UID';
$lang['tyor'] = 'И';
$lang['tyand'] = 'ИЛИ';

$lang['fnbz'] = 'Файл не может быть загружен!';
$lang['file'] = 'Файл';
$lang['add'] = 'Добавить';
$lang['nazvfi'] = 'Название файла';
$lang['razmer'] = 'Размер';
$lang['datasoz'] = 'Дата создания';
$lang['nichenn'] = 'Нечего не найдено';

$lang['botnotfound'] = 'Бот не найден.';
$lang['nbsdpre'] = 'Найден бот с другим префиксом но с данным UID.';
$lang['posmtr'] = 'Посмотреть';
$lang['uid'] = 'UID';
$lang['os'] = 'ОС';
$lang['perots'] = 'Первый отстук';
$lang['poslot'] = 'Последний раз был';
$lang['minvmo'] = 'Минимальное время между отстуком';
$lang['maxvmo'] = 'Максимальное время между отстуком';
$lang['vjib'] = 'Время жизни бота';
$lang['hunter'] = 'Хантер';
$lang['comment'] = 'Комментарий';
$lang['edit'] = 'Изменить';
$lang['lickom'] = 'Личная комманда';
$lang['listip'] = 'Список IP';
$lang['data'] = 'Дата';
$lang['listcab'] = 'Список кабов';
$lang['listkeylog'] = 'Список записей Кейлогера';
$lang['progs'] = 'Программа';
$lang['type'] = 'Тип';
$lang['files'] = 'Файлов';
$lang['svdds'] = 'Скачать все данные данной строки';
$lang['download'] = 'Скачать';
$lang['listlog'] = 'Список логов';
$lang['slheap'] = 'Список логов Heap';
$lang['listscreen'] = 'Список скриншотов';
$lang['listproc'] = 'Список процессов';

$lang['dobzada'] = 'Добавить задание';
$lang['links'] = 'Ссылки';
$lang['edvszad'] = 'Удалить все задания';
$lang['status'] = 'Статус';
$lang['cmd'] = 'Комманда';
$lang['fulfilled'] = 'Выполнено';
$lang['vkluc'] = 'Включить';
$lang['vikluc'] = 'Выключить';
$lang['novim'] = 'Новым';
$lang['zareg'] = 'Зарег.';

$lang['cmdtype'] = 'Тип комманды';
$lang['vibtyz'] = 'Выбирете тип задания';
$lang['dlolauf'] = 'Скачать и запустить файл';
$lang['dlolaufm'] = 'Скачать и запустить файлы (Multi)';
$lang['updates'] = 'Обновление';
$lang['sb'] = 'sb ip:port';
$lang['bc'] = 'bc ip:port';
$lang['upcfg'] = 'Обновить конфиг';
$lang['delcoo'] = 'Удалить куки';
$lang['cvsiskbdz'] = 'Выбирете страну или страны которым будет даватся задание.';
$lang['cvksbdk'] = 'Выбирете какому статусу будет даватся комманда.';
$lang['cnb'] = 'Новый бот';
$lang['czb'] = 'Зарегистрированный бот';
$lang['alls'] = 'Всем';
$lang['ogpk'] = 'Ограничение по количеству';
$lang['cvkddkpk'] = 'Выбирете как долго давать комманду по колличеству.';
$lang['cogdz'] = 'Ограничиваться данным заданием';
$lang['cdoldzeo'] = 'Выбирете ограничиваться ли данным заданием.\nТ.е. если ограничение включено то после получения данного задания бот не будет получать больше заданий.';
$lang['cvoinp'] = 'Выбирете один или несколько префиксов.';
$lang['clinks'] = 'Ссылка';
$lang['napsil'] = 'Напишите ссылку (ссылки при типе Multi, через пробел) если она нужна для задания.';
$lang['addcmd'] = 'Добавление задания';

$lang['editcmd'] = 'Изменение задания';
$lang['dateadd'] = 'Дата добавления';
$lang['infob'] = 'Информация о боте';
$lang['slejzb'] = 'Слежение за ботом';
$lang['date'] = 'Дата';

$lang['rehash'] = 'Перешифровать';

$lang['zvl'] = 'Запись в логах';

$lang['admin'] = 'Права админа';

$lang['ver'] = 'Версия';

$lang['domains_nkz'] = 'Назад к заданиям';

$lang['domains'] = 'Домены';
$lang['domains_add'] = 'Добавление доменов';
$lang['domains_del'] = 'Удаление доменов';

$lang['domain'] = 'Домен';
$lang['status'] = 'Статус';
$lang['send'] = 'Отдан';
$lang['update'] = 'Дата обновления';

$lang['std'] = 'Доступен';
$lang['szpt'] = 'Заблокирован';
$lang['snpr'] = 'Не проверен';
$lang['stds'] = 'Проверен';

$lang['av'] = 'AV';

$lang['pgt'] = 'ПГЗ';
$lang['pgt_title'] = 'Персональные Груповые Задания';

$lang['uids'] = 'Список UID';


$lang['p2p'] = 'P2P';
$lang['port'] = 'Port';
$lang['datacfg'] = 'Получение Конфига';
$lang['addhots'] = 'Хосты';

?>
