<?php
//$lang[''] = '';

$lang['fnbz'] = 'Файл не может быть загружен!';
$lang['file'] = 'Файл';
$lang['add'] = 'Добавить';
$lang['nazvfi'] = 'Название файла';
$lang['datasoz'] = 'Дата создания';
$lang['nichenn'] = 'Нечего не найдено';

$lang['dateadd'] = 'Дата добавления';
$lang['date'] = 'Дата';

$lang['domains'] = 'Домены';
$lang['domains_add'] = 'Добавление доменов';
$lang['domains_del'] = 'Удаление доменов';

$lang['domain'] = 'Домен';
$lang['status'] = 'Статус';
$lang['send'] = 'Отдан';
$lang['update'] = 'Дата обновления';

$lang['std'] = 'Доступен';
$lang['szpt'] = 'Заблокирован';
$lang['snpr'] = 'Не проверен';
$lang['stds'] = 'Проверен';

$lang['av'] = 'AV';

$lang['nkz'] = 'Назад';

$lang['builds'] = 'Билды';
$lang['builds_add'] = 'Добавить билд';
$lang['builds_del'] = 'Удалить билд';
$lang['start_builds'] = 'Запустить проверку';

$lang['builds_traf'] = 'Билды трафа';

$lang['orig'] = 'Оригинал';
$lang['crypt'] = 'Криптованный';

$lang['stus'] = 'Статус';

$lang['status'] = array();
$lang['status']['0'] = 'Не проверялся';
$lang['status']['1'] = 'Криптование';
$lang['status']['2'] = 'Архивирование';
$lang['status']['3'] = 'Загрузка/Проверка scan4you.net';
$lang['status']['4'] = 'Поиск файла';
$lang['status']['5'] = 'Ожидание очереди';
$lang['status']['6'] = 'Проверка chk4me.com';
$lang['status']['7'] = 'Загрузка chk4me.com';
$lang['status']['84'] = 'Ошибка загрузки файла';
$lang['status']['85'] = 'Подготовка к криптованию';
$lang['status']['86'] = 'Ошибка проверки chk4me.com';
$lang['status']['87'] = $lang['status']['86'];
$lang['status']['88'] = 'Ошибка обработки АВ';
$lang['status']['89'] = 'Ошибка подготовки';
$lang['status']['90'] = 'Файл не найден';
$lang['status']['91'] = 'Ошибка составления';
$lang['status']['92'] = 'Ошибка архивирования';
$lang['status']['93'] = 'Не найден архив';
$lang['status']['94'] = 'Ошибка проверки АВ';
$lang['status']['95'] = 'Ошибка просчета PRIO';
$lang['status']['96'] = 'Ошибка копирования';
$lang['status']['97'] = 'Заблокирован';
$lang['status']['98'] = 'Доступен';
$lang['status']['99'] = 'Проверен';

$lang['dcfb'] = 'Домены для бота';
$lang['dcfc'] = 'Проверка доменов';

$lang['ppsd'] = 'Просто проверить список доменов';

$lang['comm'] = 'Комментарий';

$lang['recrypt'] = 'Перекриптовывать файл перед каждой проверкой';

$lang['t1'] = 'Билд для бота';
$lang['t2'] = 'Билд некриптованный для бота';
$lang['t3'] = 'Билд некриптованный для трафа';
$lang['t4'] = 'Проверить файл';
$lang['t5'] = 'Проверить некриптованный файл';

$lang['l1'] = 'Билд для бота';
$lang['l2'] = 'Билд для трафа';
$lang['l3'] = 'Проверка файлов';

$lang['type_empty'] = 'Пустой тип';
$lang['type_unknow'] = 'Неизвестный тип';
$lang['file_empty'] = 'Файл пустой';
$lang['file_copy'] = 'Не могу скопировать файл';
$lang['file_exist'] = 'Файл уже существует';


$lang['add_builds'] = 'Добавление билдов';
$lang['edit_builds'] = 'Изменение билда';


?>
