<?php
//$lang[''] = '';

$lang['lang'] = 'Язык';
$lang['lyvz'] = 'Доступ для Вас закрыт!';
$lang['yvnpnd'] = 'У Вас нет прав на данное действие.';
$lang['enter'] = 'Вход';
$lang['login'] = 'Логин';
$lang['pass'] = 'Пароль';
$lang['autorize'] = 'Авторизоваться';
$lang['adnp'] = 'Добавление нового пользователя';
$lang['rpass'] = 'Повтор пароля';
$lang['pref'] = 'Префикс';
$lang['ads'] = 'Джаббер для связи';
$lang['auhu'] = 'Пользователь-охотник';
$lang['aovjl'] = 'отправлять в джабер ссылки';
$lang['alktsb'] = 'личные команды только sb и bc';
$lang['on'] = 'Включено';
$lang['off'] = 'Выключено';
$lang['aopb'] = 'Ограничить показ ботов';
$lang['aopkl'] = 'Ограничить показ программ';
$lang['avrkl'] = 'в разделе кейлогер';
$lang['avrcl'] = 'в разделе кабы';
$lang['apboztbkp'] = 'показывать ботов и их записи только тех ботов которых поймал';
$lang['alpd'] = 'Личные права доступа';
$lang['agd'] = 'Глобальный доступ';
$lang['add'] = 'Добавить';
$lang['ad'] = 'Доступ';
$lang['adyd'] = 'Действительно удалить?';
$lang['profile'] = 'Профиль';

$lang['apd'] = 'Права доступа для';
$lang['aizp'] = 'Изменение пользователя';
$lang['edit'] = 'Изменить';
$lang['adiz'] = 'Данные изменены!';
$lang['asp'] = 'Создать пользователя';
$lang['avp'] = 'Всего пользователей';
$lang['date_reg'] = 'Дата регистрации';
$lang['apd1'] = 'Права доступа';
$lang['adel'] = 'Удаление';
$lang['ainfo'] = 'Информация о пользователе';
$lang['status'] = 'Статус';
$lang['online'] = 'Онлайн';
$lang['offline'] = 'Оффлайн';
$lang['autord'] = 'Авторизация';
$lang['ara'] = 'Разрешено';
$lang['aza'] = 'Запрещено';
$lang['aza1'] = 'Запретить';
$lang['ara1'] = 'Разрешить';
$lang['apa'] = 'Последняя активность';
$lang['azareg'] = 'Зарегистрирован';
$lang['aedp'] = 'Изменение профиля';
$lang['aekr'] = 'Экран';
$lang['os'] = 'ОС';
$lang['localize'] = 'Локализация';
$lang['ip'] = 'IP';
$lang['brouz'] = 'Браузер';
$lang['anp'] = 'Настройки пользователя';
$lang['akz'] = 'Колличество записей<br />на странице "Боты"';
$lang['akz1'] = 'Колличество записей<br />на странице "Боты->Страна"';
$lang['akz2'] = 'Колличество записей<br />на странице "Кейлогер"';
$lang['akz3'] = 'Колличество записей<br />на странице "Кейлогер->Программа"';
$lang['akz4'] = 'Колличество записей<br />на странице "Кабы"';
$lang['akz5'] = 'Колличество записей<br />на странице "Фильтры"';
$lang['alnbp'] = 'Логин не может быть пустым.';
$lang['avlye'] = 'Введенный логин уже есть в системе.';
$lang['apnbp'] = 'Пароль не может быть пустым.';
$lang['apens'] = '"Пароль" и "Повтор пароля" не совпадают.';
$lang['asyzsnv'] = 'Создание учетной записи сейчас невозможно, попробуйте позже.';
$lang['aisnp'] = 'Изменение сейчас невозможно, попробуйте позже.';
$lang['aint'] = 'Изменение не требуется.';

// Начало Права доступа

$lang['main_index'] = 'Главная';
$lang['main_edit'] = 'Изменение информации на главной';
$lang['main_info'] = 'Информация о сервере, ПО и т.п.';

$lang['accounts_index'] = 'Пользователи';
$lang['accounts_list'] = 'Список пользователей';
$lang['accounts_create'] = 'Добавление';
$lang['accounts_edit'] = 'Изменение своих данных';
$lang['accounts_edits'] = 'Изменение не своих данных';
$lang['accounts_delete'] = 'Удаление';
$lang['accounts_profile'] = 'Просмотр инфо о себе';
$lang['accounts_profiles'] = 'Просмотр инфо не о себе';
$lang['accounts_enableanddisable'] = 'Включение/Отключение пользователя';
$lang['accounts_rights'] = 'Личные права доступа';
$lang['accounts_right'] = 'Не личные права доступа';
$lang['accounts_settings'] = 'Изменение личных настроек';
$lang['accounts_setting'] = 'Изменение не личных настроек';

$lang['settings_index'] = 'Настройки';

$lang['servers_index'] = 'Серверы';
$lang['servers_add'] = 'Добавить сервер';
$lang['servers_edit'] = 'Изменить сервер';
$lang['servers_del'] = 'Удалить сервер';
$lang['servers_auto_install'] = 'Автоустановка сервера';

$lang['clients_index'] = 'Серверы';
$lang['clients_add'] = 'Добавить клиента';
$lang['clients_edit'] = 'Изменить клиента';
$lang['clients_logs'] = 'Просмотр логов';
$lang['clients_regenerate'] = 'Пересоздание всех ключей';
$lang['clients_download'] = 'Закачка конфигов';


// Конец Права доступа

?>
