<?php
//$lang[''] = '';
$lang['jb'] = 'Жизнь бота (в минутах)';
$lang['supd'] = 'Скрипт автообновления';
$lang['lsip'] = 'Ссылка на отправку IP';
$lang['login'] = 'Логин';
$lang['pass'] = 'Пароль';

$lang['ip'] = 'IP сервера';
$lang['port'] = 'Порт сервера';
$lang['esa'] = 'Папка easy-rsa';
$lang['portm'] = 'Порт менеджера';


$lang['ko'] = 'кому отправлять';
$lang['sijcf'] = 'Сообщать в Jabber Cab-файлы';
$lang['true'] = 'Включен';
$lang['false'] = 'Выключен';
$lang['vopovza'] = 'При включении/отключении происходит очистка всех заданий в админке!';
$lang['shd'] = 'Шифрование данных';
$lang['key'] = 'Ключ';
$lang['fl'] = 'Формат логов';
$lang['olf'] = 'Обрабатывать логи для "Фильтры"';
$lang['dkapk'] = 'Доступ к авторизации по ключу';
$lang['lia'] = 'Ссылка авторизации';
$lang['textot'] = 'Текст ответа';
$lang['kpkonsob'] = 'Комментарий при котором охотникам не сообщать о боте';
$lang['startjabber'] = 'Запустить Jabber-клиент';
$lang['stopjabber'] = 'Остановить Jabber-клиент';
$lang['lang'] = 'Язык';
$lang['gws'] = 'Ссылки на шлюз';
$lang['plfg'] = 'Не принимать логи';
$lang['pli'] = 'Не принимать инжекты';
$lang['plc'] = 'Не принимать кабы';
$lang['plk'] = 'Не принимать кейлогер';

?>
