<?php
//$lang[''] = '';

$lang['knbp'] = 'Название не может быть пустым.';
$lang['xnmbp'] = 'Хеш не может быть пустым.';
$lang['vxyes'] = 'Введенный хеш уже есть в системе.';
$lang['dzsnp'] = 'Добавление записи сейчас невозможно, попробуйте позже.';
$lang['prog'] = 'Программа';
$lang['nksp'] = 'Назад к списку программ';
$lang['uid'] = 'UID';
$lang['bot'] = 'Бот';
$lang['comm'] = 'Комментарий';
$lang['zapis'] = 'Записей';
$lang['datad'] = 'Дата добавления';
$lang['maxstr'] = 'Максимально на странице';
$lang['vsego'] = 'Всего';
$lang['show'] = 'посмотреть';
$lang['hashz'] = 'Хеш-запуска';
$lang['nsz'] = 'Назад к списку записей';
$lang['ipcou'] = 'IP (Страна)';
$lang['posledot'] = 'Последний отстук';
$lang['scren'] = 'Скриншот';
$lang['log'] = 'Лог';
$lang['name'] = 'Название';
$lang['kolbot'] = 'Количество ботов';
$lang['addprog'] = 'Добавить программу';
$lang['delprog'] = 'Добавить программу';
$lang['hashprog'] = 'Хеш программы';
$lang['add'] = 'Добавить';
$lang['kdd'] = 'Данные добавлены!';
$lang['kde'] = 'Данные изменены!';
$lang['zakr'] = 'Закрыть окно';
$lang['add_prog'] = 'Добавление программы';
$lang['edit_prog'] = 'Изменение программы';
$lang['edit'] = 'Измененить';
$lang['editno'] = 'Изменение не требуется';
$lang['adyd'] = 'Действительно удалить?';
$lang['delyb']  = 'Действительно удалить (без восстановления)?';
$lang['delyt']  = 'Действительно удалить (переместить в корзину)?';
$lang['trash'] = 'Корзина';
$lang['trashext'] = 'Выйти из корзины';
$lang['trasclear'] = 'Очистить корзину';

?>