<?php
//$lang[''] = '';

$lang['install'] = 'Установка';
$lang['ip'] = 'Ваш IP';
$lang['cs'] = 'Проверка софта';
$lang['vp'] = 'Версия PHP';
$lang['module'] = 'Модуль';
$lang['nw'] = 'не работает';
$lang['wo'] = 'работает';
$lang['io'] = 'Установлен (откомпилированный)';
$lang['ev'] = 'Есть (выносной)';
$lang['ni'] = 'Не установлен';
$lang['in'] = 'Установлен';
$lang['fu'] = 'Функция';
$lang['ot'] = 'отсутствие';
$lang['pn'] = 'Продолжение невозможно';
$lang['nk'] = 'Не все компоненты установлены или соответствуют требованиям';
$lang['next'] = 'Продолжить';

$lang['py'] = 'Проверка и установка прав';
$lang['nd'] = 'нет доступа на запись, установить невозможно.';
$lang['pf'] = 'Права доступа на папки и файлы установлены.';

$lang['nm'] = 'Настройка MySQLi';
$lang['myi'] = 'MySQLi подключено и настроенно.';
$lang['pnr'] = 'Пользователь не имеет прав на запись данных в файл.';
$lang['npm'] = 'Не могу подключится к MySQL серверу';
$lang['nsp'] = 'Не могу создать процедуру/функцию';
$lang['ads'] = 'Адресс сервера';
$lang['pol'] = 'Пользователь';
$lang['pas'] = 'Пароль';
$lang['bad'] = 'БазаДанных';

$lang['dcz'] = 'Добавление крон заданий';
$lang['ndc'] = 'Не могу добавить крон задания.';
$lang['vns'] = 'Выполните на сервере:';
$lang['znf'] = 'и затем нажмите в браузере F5 или пропустите данное действие.';
$lang['skip'] = 'Пропустить';
$lang['zcd'] = 'Задания в крон добавлены.';

$lang['ps'] = 'Последние шаги';
$lang['zav'] = 'Завершено.';
$lang['aut'] = 'Авторизоваться';

$lang['ss'] = 'Социальные сети';
$lang['es'] = 'Емаил сайты';
$lang['pls'] = 'Платежные системы';
$lang['trs'] = 'Торрент сайты';
$lang['fs'] = 'Файлообменные сайты';
$lang['drsa'] = 'Другие сайты';
$lang['drsi'] = 'Другие системы';
$lang['mej'] = 'Международные';
$lang['sng'] = 'СНГ';

?>
