<?php
// libs/a/a.charset.php
// (c) Yuri Popoff, Nov 2003, popoff.donetsk.ua
// A set of functions to process charsets

function _charset_count_bad($s)
{ //count "bad" symbols in russian, in windows-1251
  $r=0;
  for($i=0;$i<strlen($s);$i++)
  {
    switch($s[$i])
    {
      case '¸':
      case '¨':
      case '«':
      case '»':
        break;
      default:
        $c=ord($s[$i]);
        if($c>=0x80&&$c<0xc0||$c<32)
          $r++;
    }
  }
  return $r;
}

function _charset_count_chars($s)
{ //count "good" symbols in russian, in windows-1251
  $r=0;
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=0xc0)
      $r++;
  }
  return $r;
}

function _charset_count_pairs($s)
{ //count "bad" pairs of chars for a string in russian, in windows-1251
  $a=array(
    0 => 'תûü',
    1 => 'יןפ‎',
    2 => 'יפ‎',
    3 => 'זיןפץצשתûü‎‏',
    4 => 'יפש',
    5 => 'תûü',
    6 => 'חיעפץרשתû‎ÿ',
    7 => 'יןפץש',
    8 => 'תûü',
    9 => 'אבזטיףשתûü‎‏ÿ',
    10 => 'בדיןפץשתûü‎‏ÿ',
    11 => 'ינצת‎',
    12 => 'הזחית',
    13 => 'ילןת',
    14 => 'תûü',
    15 => 'בגדהזחיץשת‎‏',
    16 => 'ית‎',
    17 => 'י',
    18 => 'זי',
    19 => 'תûü',
    20 => 'בגדהזחיךןץצרשתü‎‏ÿ',
    21 => 'בזחיפץצקשתûü‏ÿ',
    22 => 'בדהזחיכםןנסעפץצקרשתü‎‏ÿ',
    23 => 'בדהזחיןספץצקשתû‎‏ÿ',
    24 => 'בדהזחיפץרשתû‎ÿ',
    25 => 'בגדהזחיךכלןסעפץצקרשתû‎‏ÿ',
    26 => 'אבגדהזחטיךכלםמןנסעףפץצקרשתûü‎',
    27 => 'אמפתûü‎‏',
    28 => 'איכנףץתûü‎',
    29 => 'אבוזטמףצקרשתûü‎‏',
    30 => 'טמףפתûü‎ÿ',
    31 => 'אמףפתûü‎'
    );
  $b=array(
    0  => 'אאאבאגאדאהאואזאחאטאיאךאכאםאמאסאעאףאפאץאצאקאראשא‎א‏אÿבדבלבעבץבצבקברבשבתבüב‏בÿגבגזגץגתג‏דחדךדעדקדÿהההץה‎ואובודוווזוטומוןוסוףופוצושו‎ו‏וÿזבזגזכזןזנזצזקז‏חחחסחעחרח‎ח‏טאטוטזטטטיטמטןטףטפטצטרטשט‎ט‏טÿיןינךחךלךקךרכבכגכחכםכרכשלגלדלץלקל‎ל‏םבםגם‎מאמגמדמומזמחמטמימךמכמלמממןמףמפמץמצמרמשמ‎מ‏מÿןלןצנחסדסהסזסחסתס‎עבעדעהעחעןערעשעתע‎ףאףבףגףזףטףיףמףףףפףץףצףשף‏ףÿפכפלץדץהץךץןץסץרץ‎צגצלצףצûקגקלקנקררנרסרקשםשנשü‎ג‎ד‎ה‎ח‎י‎ך‎ל‎ם‎ן‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ר‏‏ÿבÿדÿהÿוÿזÿחÿטÿיÿןÿנÿרÿשÿ‏ÿÿ',
    1  => 'אאאזאמאןאפאשא‎באבבבגבדבהבזבחבךבכבלבםבסבעבףבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿדאדבדגדדדהדודחדטדךדכדלדםדנדסדעדףדקדרדÿהבהגהדהההזהחהךהכהלהםהמהןהנהסהעהץהצהקהרהתהûהüה‎ה‏ואובוןוףופו‎וÿזבזגזדזהזזזךזכזלזםזמזןזנזסזצזקזüז‏חבחגחדחהחוחזחחחטחךחכחלחםחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטאט‎ךגךהךזךחךךךכךלךםךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלךלכלללםלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמממפמץנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשסבסגסדסהסזסחסלסםסןסנססספסץסקסרסשסתסûסüס‎ס‏עאעבעגעדעהעחעטעךעכעלעםעןענעסעעעףעפעץעצעקערעשעתעûעüע‎ע‏ףמףףףצףשף‎ץדץהץוץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלצףקגקוקךקכקלקםקמקנקעקףקרקüרגרךרכרלרםרמרןרנרסרערףרצרקרüר‏שמשנשüת‏ûבûדûזûטûןûנûףûצûרûÿüבüגüדüהüזüחüךüלüםüמüןüסüעüפüצüקüרüש‏א‏ב‏ג‏ד‏ו‏ז‏ח‏י‏ך‏ל‏ם‏ן‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿגÿדÿהÿוÿזÿטÿיÿךÿםÿנÿסÿץÿצÿקÿרÿ‏ÿÿ',
    2  => 'אאאמאףאפאשא‎באבבבגבדבהבזבחבךבלבםבסבעבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגעגףגץגצגקגרגשגתגüג‏דאדבדגדדדהדודחדטדךדלדםדסדעדקדרדÿהבהדהההזהחהךהכהלהםהןהסהעהץהצהקהרהתהüה‎ה‏הÿואוטוףופו‎זאזבזגזדזהזוזזזךזכזלזםזמזןזנזסזףזצזקזüז‏חוחזחחחךחסחעחףחצחקחרחüח‎ח‏טףטפט‎ךגךהךזךחךךךלךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכףכפכץכקכרכשכûלבלגלדלךלכלללםלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמפמ‎ןךןלןםןןןסןעןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏סבסגסדסהסזסחסטסםסנססספסצסקסרסשסתסüס‎עבעגעדעהעחעךעכעלעםעןעסעעעףעפעץעצעקערעשעתעüע‎ע‏ףבףגףזףטףמףןףףףפףצף‎ץאץגץדץהץוץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלקגקךקכקלקםקנקעקרקüרגרךרכרלרםרןרנרסרערצרקרüר‏שאשושםשמשנשףשüת‏תÿûשüבüגüדüהüזüחüךüלüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿגÿדÿהÿוÿטÿיÿןÿנÿצÿקÿרÿ‏ÿÿ',
    3  => 'אאאךאמאפארא‎בבבגבדבהבזבחבטבךבכבלבםבמבנבסבעבףבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדאדבדגדדדהדחדךדכדלדםדמדנדסדעדףדקדרדÿהבהגהדהההזהחהטהךהכהלהםהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿואוגודוזוחוןוףוץוצוקורושו‎חבחגחדחהחוחזחחחטחךחכחלחםחמחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטזטףטפטצטשט‎ךגךהךוךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüלבלגלדלטלךלכלללםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםûםüם‎מ‏נבנגנדנהנזנחנךנכנלנןנננסנענפנץנצנקנרנשנüסאסבסגסדסהסוסזסחסטסכסלסםסןסנסססףספסץסצסקסרסשסתסûסüס‎ס‏עאעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעûעüע‎ףגףדףחףטףיףךףמףןףףףפףצף‎ףÿקגקךקכקלקםקמקנקעקרקüרארגרךרכרלרםרמרןרנרסרףרצרקרüר‏ÿבÿגÿדÿוÿזÿחÿטÿיÿךÿכÿםÿןÿנÿסÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
    4  => 'אאאחאףאשא‎בבבגבדבהבזבחבךבכבלבםבסבעבףבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגלגםגןגנגסגעגץגצגקגרגשגתגüג‏גÿדבדגדדדהדודחדךדלדםדסדעדףדקדרדÿהבהדהההזהחהךהכהלהםהןהנהסהעהץהצהקהרהתהûהüה‎ה‏הÿוףוץושו‎זבזגזדזהזזזךזכזלזםזןזנזסזצזקזüז‏חבחגחדחהחזחחחךחכחלחנחסחעחצחקחרחתחûחüח‏חÿטדטץט‎ךגךהךזךחךךךלךםךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüכ‏לבלגלדלךלכלללןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםכםםםנםסםפםץםצםקםרםשםüם‎מאמפמ‎מ‏מÿןוןךןלןםןןןסןעןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננענפנץנצנקנרנשנüסבסדסהסזסחסםסנססספסץסצסרסשסתסûסüס‎ס‏סÿעבעדעהעחעךעכעלעםעןעסעעעףעפעץעצעקערעשעתעûעüע‎ע‏ףהףחףפץדץהץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלקגקךקכקלקםקמקנקעקרקüרגרךרכרלרםרמרןרנרסרצרקרüר‏ûחûטûףûצûÿüגüדüהüזüחüםüמüןüסüפüצüקüרüש‎ד‎ה‎ח‎י‎כ‎ל‎ן‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏כ‏ל‏ס‏ע‏ץ‏צ‏ק‏ש‏‏ÿבÿגÿוÿזÿחÿךÿכÿןÿנÿצÿרÿ‏ÿÿ',
    5  => 'אאאואזאחאטאיאמאןאנאסאףאפאץאצאקאראשא‎א‏אÿבבבגבדבהבזבחבץבצבקברבשבתגבגגגדגזגןגץגשגתג‏דבדגדדדחדעדרהדהץהצה‏ואובודוהוווזוטוכוםומוףופושו‎ו‏וÿזבזגזזזלזקז‏חסחצחרחתח‎טאטבטהטוטזטטטיטמטנטףטפטצטקטרטשט‎ט‏טÿיגימיץךזךחךךךלךקכהכזכחכןכפכץכרכשלגלנלפלץלרל‎ל‏םזםכםפם‎מאמומטמימףמקמרמ‏מÿןלןןןפנשסדסזסחסשסתס‎ס‏עדעהעחעןעפעצעשעתע‎ע‏ףאףטףיףמףףףפףצףרףשף‎פלפםפספקפûץדץךץנץעץרצגצלצףקגקלקנקררגרלרןרנרצרקר‏שםשמ‎ג‎ד‎ה‎ח‎י‎כ‎ל‎ם‎ן‎נ‎ס‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿדÿוÿזÿחÿטÿיÿךÿןÿצÿקÿרÿשÿ‏ÿÿ',
    6  => 'אאאבאחאטאמאןאףאפאצארא‎בבבגבדבהבזבחבךבכבלבםבנבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגוגזגחגטגךגכגלגםגמגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדודחדךדלדםדמדנדסדעדקדרדÿהבהגהדהההזהחהךהלהםהןהנהסהעהץהצהקהרהתה‎ואוזוטומוףוץו‎ו‏וÿזבזגזדזהזזזךזכזלזםזמזןזנזסזףזצזקזüז‏טאטבטףטפט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכוכזכחכךכככלכםכמכןכסכעכףכפכץכקכרכשכûכüכ‏כÿלאלבלגלדלךלכלללםלןלנלסלעלפלץלצלקלרלשלûלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמבמגמהמזמטמכמממןמעמףמפמץמצמשמ‎מ‏מÿןאןוןטןךןלןםןמןןןנןסןעןףןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססעסףספסץסצסקסרסשסתסûסüס‎ס‏סÿףבףגףדףהףחףלףמףןףףףפףצףרף‎צגצוצטצךצלצמקאקגקוקךקכקלקםקמקנקעקףקרקüüבüגüדüהüזüחüךüלüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏ל‏ם‏ן‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏',
    7  => 'א‎בבבגבדבהבזבחבךבלבםבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגזגחגלגןגסגעגץגצגקגרגשגתגüג‏דבדגדדדהדחדךדלדסדעדקדרדÿהבהדהההזהחהכהלהןהסהעהץהצהקהרהתה‎ה‏ואודוהוזוחומוןוסוףוץוקושו‎זבזגזדזהזזזךזכזלזםזמזןזנזסזצזקזüז‏חבחדחהחוחזחחחטחךחכחלחמחסחעחףחצחקחרחתחûחüח‎ח‏חÿטבטחטןטפטץטשט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüלבלגלדלךלכלללנלסלעלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשם‎מאמזמטמףמפמצמ‎מ‏מÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏סאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססעסףספסץסצסקסרסשסתסûסüס‎ס‏סÿעאעבעגעדעהעועחעךעכעלעםעןענעסעעעףעפעץעצעקערעשעתעûע‎ע‏עÿףגףדףזףמףףףפףצףרף‎צגצוצטצךצלקאקגקךקכקלקםקמקנקעקרקüרארגרורךרכרלרםרמרןרנרסרערףרצרקרüר‏ûהûזûטûכûןûעûףûרûÿüגüדüהüזüחüטüךüםüמüןüסüפüצüקüרüש‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ן‎נ‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ם‏ן‏נ‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏ÿדÿהÿזÿחÿךÿןÿנÿסÿץÿצÿרÿ‏ÿÿ',
    8  => 'אאאואזאטאיאמאףאץאקאשא‎א‏בגבדבזבחבלבעבץבצבקבשבתבÿגבגגגדגהגזגחגלגןגעגשגתג‏דבדגדדדךדסדקדÿהבהדהההכהןהץהקהרהתהüה‎ואובוווזוטוךומוןוףופוקורושו‎ו‏וÿזבזגזדזזזכזלזןזנזצזקזüז‏חחחעחצחüח‎ח‏טאטבטגטדטהטוטזטחטטטיטךטכטםטמטןטעטףטפטץטצטקטרטשט‎ט‏טÿיגידיהיויחיךיכילימיניפיץיקירךהךזךחכבכדכזכחכלכםכןכעכפכץכקכרכשלנלעלץלרלשלüל‎ל‏םכםנםרםשם‎מומזמטמימממףמפמצמקמרמשמ‏מÿןלןפןצןקןüנדנחנפנץנצנשנüסבסדסזסחסנספסשסתס‎עבעדעהעחעןעפעץערעשעתע‏ףאףבףגףוףזףחףטףיףמףנףףףפףץףצףרףשף‎ף‏ףÿפכפםפקץדץהץךץלץעץרץ‎צגצלקגקכקלקנקררגרןרנרסרערצרקר‏שמשü‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ם‎ן‎נ‎ס‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏ל‏נ‏ס‏ץ‏צ‏ק‏ר‏‏ÿבÿדÿהÿטÿיÿךÿנÿסÿצÿקÿרÿש',
    9  => 'גבגגגדגהגוגזגחגטגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדודחדטדךדכדלדםדמדנדסדעדףדקדרדÿהבהגהדהההחהךהכהלהםהןהנהסהץהצהקהרהתהûהüה‎ה‏ואובוגודוהוווזוחוטויוךולומוןוסועוףופוץוצוקורושו‎ו‏וÿחבחגחדחהחזחחחטחךחכחלחםחמחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿךגךהךזךחךךךלךםךנךעךצךקךרכבכגכדכהכזכךכככלכםכןכסכעכפכץכקכרכשכüכ‏כÿלבלגלדלךלללםלןלנלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםשםüם‎מאמבמומזמטמימכמלמממןמסמףמפמץמצמקמרמשמ‎מ‏מÿןאןטןךןכןלןםןמןןןנןסןעןףןצןקןרןûןüןÿנאנבנגנדנהנונזנחנטנךנכנלנםנןנננסנענףנפנץנצנקנרנשנûנüנ‏נÿסגסדסהסוסזסחסכסםסןסנססספסץסצסקסרסשסתסüס‎ס‏עבעגעדעהעחעךעכעלעםעןעעעפעץעצעקערעשעתעûעüע‎ע‏עÿפכפלפםפנפספעפפפקפûץגץדץהץוץטץךץכץלץםץמץןץנץסץעץףץרץ‎צגצטצךצלקגקוקךקכקלקםקמקנקעקףקרקüרגרךרכרלרםרמרןרנרסרערצרקרüר‏',
    10 => 'אאאשא‎גבגגגדגהגזגחגךגכגלגםגןגנגסגעגץגצגקגרגשגתגüג‏גÿהאהבהגהדהההוהזהחהטהךהכהלהםהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿובודוזוטומוףופוץוצוקורושו‎ו‏וÿזאזבזגזדזהזזזטזךזכזלזםזמזןזנזסזףזצזקזüז‏חבחגחדחהחזחחחךחכחלחםחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטדטזטצטשט‎ט‏ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלטלךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏מאמצנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנשנüסבסהסזסחסכסלסנסססץסקסשסתסüס‎ס‏עבעגעדעהעחעךעכעלעןעסעעעפעץעצעקערעשעתעüע‎ע‏ףאףדףזףיףמףפףצף‎צאצגצךצלצמצףצûקאקגקטקךקכקלקםקמקנקעקףקרקüרגרךרכרלרםרמרןרנרסרערצרקרüר‏',
    11 => 'אאאמאפא‎בבבגבדבהבזבחבךבכבלבסבעבץבקברבשבתבüב‏בÿגבגגגדגהגזגחגלגןגנגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדחדךדכדלדםדסדעדקדרדÿהבהגהדהההזהחהךהכהלהןהנהעהץהצהקהרהתהüה‎הÿואזבזגזדזהזזזךזכזלזמזןזנזסזףזצזקזüז‏חבחגחדחהחזחחחטחלחמחנחסחצחקחרחתחûחüח‎ח‏חÿטףט‎ךהךזךחךךךלךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכעכפכץכקכרכשלבלגלדלךלכלללםלןלנלעלףלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםקםרםשםüם‎ם‏מ‎מ‏ןךןכןלןםןןןנןסןעןפןצןקןרןüסבסגסדסהסזסחסכסלסםסןסנססספסץסצסקסרסשסתסûסüס‎ס‏עבעגעדעהעחעטעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏עÿףשפטפכפלפםפמפנפספעפףפפפקפûץאץדץהץוץךץכץלץםץןץנץסץעץףץרץ‎קגקכקלקנקעקררארגרטרךרכרלרםרמרןרנרסרערףרצרקרüר‏שםשמשנשףשüûדûהûחûטûנûףûצûÿ‏א‏ד‏ו‏יÿבÿט',
    12 => 'אאאבאמאןאףאשבבבגבדבהבזבחבךבלבםבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגוגזגחגטגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדאדבדגדדדהדודחדטדךדלדמדנדסדעדףדקדרדÿואוןוףו‎טאטבטזטשט‎ךגךהךזךחךךךכךלךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכמכןכסכעכףכפכץכקכרכשכûכüלבלגלדלךלכלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאןךןלןםןןןסןפןצןקןÿנבנגנדנהנזנחנךנכנלנםנמנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסבסגסדסהסזסחסכסלסםסןסנססספסץסצסקסרסשסתסûס‎ס‏עאעבעגעדעהעחעךעכעלעםעמעןענעסעעעףעפעץעצעקערעשעתעûעüע‎ע‏עÿףבףגףוףטףיףמףףףצף‎ףÿפכפלפםפנפספעפפפקפûץאץגץדץהץוץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלצמקגקךקכקלקםקמקנקעקרקüרארגרךרכרלרםרמרןרנרסרערףרצרקרüר‏שאשםשמשנשףשüûבûהûזûחûטûןûנûףûצûשûÿüבüגüדüזüחüךüלüםüמüןüפüצüקüרüש‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ן‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏ל‏ן‏נ‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿהÿוÿזÿחÿיÿןÿנÿץÿצÿ‏ÿÿ',
    13 => 'אאאפא‎בבבגבדבהבזבחבטבךבכבלבםבמבנבסבעבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגץגצגקגרגשגתגûגüג‏גÿדבדדדחדךדלדםדקדרדÿהבהגהדהההחהךהןהקהתהüה‎הÿושזבזגזדזהזזזךזכזלזםזמזןזנזסזצזקזüז‏חבחגחדחהחזחחחךחכחלחםחנחסחעחצחקחרחתחüח‎ח‏חÿטףט‎ךהךזךחךךךלךסךקךרכאכבכגכדכהכוכזכחכךכככלכםכמכןכסכעכףכפכץכקכרכשכûכüכ‏כÿםבםגםדםהםזםחםךםכםםםנםסםפםץםצםקםרםשםüם‎משנבנגנדנהנזנחנךנכנלנםנןנננסנענףנפנץנצנקנרנשנûנüנ‏נÿסדסהסזסחסנסץסקסרסשסתסüס‎ס‏סÿעבעגעהעחעלעןעעעפעץעצעקערעשעתעüע‎ףבףדףחףטףמףןףףףפףץףצף‎פלפםפספעפפפקפûץאץגץדץהץטץךץכץלץםץןץסץעץףץרץ‎צגצךצלקגקךקכקלקםקנקעקרקüרגרורךרכרלרםרמרןרנרסרףרצרקרüר‏שאשושםשמשנשףשüûבûדûהûזûחûטûךûסûףûצûשûÿüבüגüהüחüלüםüןüפüצüקüש‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ם‎נ‎ס‎ע‎פ‎ץ‎ÿ‏ב‏ג‏ד‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏נ‏צÿבÿהÿןÿנÿצ',
    14 => 'אאאבאגאדאהאואזאטאיאכאלאמאףאפאץאצאקאראשא‎א‏אÿבצב‏גהגזגץגתג‏דגדדדחדךדסדקדרדÿה‎ה‏ואובוווטונוףופושו‎וÿזבזגזכזןזנזסזקז‏חסחעחצחקחרחתח‎ח‏טאטבטוטזטטטיטמטןטףטפט‎ט‏טÿיגידיויחיןיניפיץירךהךזךלךצךקכפלגלדלץלרלשל‎ל‏םץםרם‎מאמגמדמומזמחמטמימכמלמףמפמרמ‎מ‏מÿןלןפןרסדסחסשס‎ע‎ע‏ףאףוףזףטףיףמףנףףףפףצףרףשף‏ףÿפלפםפעפקץדץהץךץןץסץ‎צףצûקלקנקררנרסרצרקשמ‎ה‎י‎ן‎ס‎ץ‎ÿ‏א‏ב‏ג‏ד‏ז‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏רÿדÿוÿטÿןÿצÿקÿרÿ‏ÿÿ',
    15 => 'אאאמא‎ואובוטולוףופו‎וÿטבטףטפט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלאלבלגלדלולךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏מאןלןןןנןסןעןפןצןקןרןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏סבסגסדסהסזסחסכסלסםסןסנססספסץסצסקסרסשסתסüס‎ס‏סÿעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏עÿףגףוףזףטףיףלףמףףףפףצף‎ףÿפופכפלפםפמפספעפףפפפקפûצאצגצוצךצלצמקגקךקכקלקםקמקנקעקףקרקüרארגרךרכרלרםרמרןרנרסרערצרקרüר‏ûבûהûחûטûךûםûןûסûףûצûקûÿüבüגüדüהüזüחüטüךüלüםüמüןüסüעüפüצüקüרüשÿבÿגÿדÿהÿוÿזÿחÿטÿיÿךÿלÿםÿןÿנÿצÿקÿרÿ‏ÿÿ',
    16 => 'א‎בבבגבדבהבזבחבךבלבעבץבצבקברבשבתבûבüבÿגבגגגדגהגזגחגךגכגלגןגנגסגעגץגצגקגרגשגתדבדגדדדהדחדךדלדעדקדÿהבהגהדהההחהךהכהןהנהעהץהקהרהתהüה‎ו‎זבזגזדזזזכזלזמזןזנזסזקזüז‏חבחגחדחהחזחחחלחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿט‎ךהךזךחךךךלךנךצךקךרכבכגכדכהכזכךכככלכםכןכסכעכפכץכקכרכשכ‏לבלגלדלךלללםלןלנלסלעלפלץלצלרלשלüל‎ל‏םגםדםהםזםחםךםכםםםנםעםפםץםצםקםרםשםüם‎ןךןלןןןסןעןפןצןקןרןüנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסבסגסדסהסזסחסכסלסםסנססספסץסצסקסרסשסתסüס‎ס‏עבעדעהעןעעעץעצעקערעשעתע‎ע‏ףגףמףףףצף‎פכפלפנפספעפףפפפקפûץגץדץכץנץעץרצגצךצלקגקךקלקםקמקנקעקרקüרגרכרלרןרסרערצרקרüר‏שאשםשמשנשףשüûטûנûףûÿüגüהüזüחüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ה‏ו‏ז‏י‏ן‏נ‏צ‏‏ÿטÿנÿצ',
    17 => 'אאאחאטאמאשבבבגבדבהבזבחבךבלבםבסבעבףבץבצבקברבשבתבüבÿגבגגגדגהגזגחגךגכגלגםגןגסגעגץגצגקגרגשגתגüג‏דאדבדגדדדהדחדךדלדסדעדקדרדÿהבהדהההזהחהךהכהלהםהןהסהעהץהצהקהרהתהûהüה‎ה‏הÿוזופו‎זבזגזדזהזזזךזכזלזםזמזןזנזסזףזצזקזüז‏חבחגחדחהחוחזחחחטחךחכחלחםחמחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטףטשט‎ךהךזךחךךךלךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלךלכלללםלןלעלפלץלצלקלרלשלüל‎ל‏םבםגםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמ‎מÿןךןלןםןןןסןעןפןצןקןרןüנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏נÿסבסדסהסזסחססספסץסצסרסשסתסüס‎ס‏עהעחעןעעעפעץערעשעתףףףצפכפלפםפנפספעפףפפפקפûץדץהץךץלץםץןץסץעץרץ‎צךצלצףצûקגקךקלקםקמקנקעקרקüרגרךרכרלרםרןרנרסרצרקרüר‏שאשטשםשמשנשףשüת‏ûבûהûזûחûטûךûףûצûקûרûÿüגüדüהüזüחüטüםüמüןüסüפüצüקüרüשüÿ‎ג‎ד‎ה‎ח‎י‎כ‎ן‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ו‏ח‏י‏ל‏ם‏ן‏ע‏ץ‏צ‏ק‏ש‏‏ÿבÿגÿטÿיÿכÿןÿנÿרÿ‏ÿÿ',
    18 => 'אאאמא‎בבבגבדבהבובזבחבךבלבםבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגזגחגךגלגםגןגסגעגץגצגקגרגשגתגüג‏דבדגדדדהדחדטדךדכדלדםדסדעדףדקדרדÿהבהגהדהההזהחהךהכהלהםהןהנהסהעהףהץהצהקהרהתהüה‎ה‏הÿוףו‎חבחדחהחוחזחחחטחךחכחלחםחנחסחעחףחצחקחרחתחüח‎ח‏חÿךגךהךזךחךךךלךעךצךקךרכבכגכדכהכזכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלךלכלללםלןלנלסלעלפלץלצלקלרלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ןךןלןםןןןסןעןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנסנענפנץנצנקנרנשסבסדסהסזסחסןססספסץסצסרסשסתסüס‎עבעגעדעהעחעךעכעלעןעסעעעפעץעצעקערעשעתעûעüע‎ע‏ףגףףפאפכפלפםפנפספעפפפקפûץדץהץוץךץלץםץןץנץסץעץרץ‎צגצטצךצלקגקךקכקלקםקמקנקעקרקüרךרלרםרמרןרנרסרצרקרüר‏שםשמשנשףשüת‏תÿûבûזûחûטûעûףûצûÿüגüדüזüחüםüמüןüצüקüרüש‎ג‎ד‎ה‎ח‎י‎כ‎ל‎ן‎נ‎ס‎ע‎פ‎ץ‎ÿ‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ם‏ן‏ס‏ע‏ץ‏צ‏ק‏ש‏‏ÿהÿוÿטÿכÿנÿקÿ‏',
    19 => 'אאאבאגאדאואזאטאךאלאמאןאףאפאץאקאראשא‎א‏אÿבגבדבהבחבלבעבץברבשב‏גבגגגדגהגזגחגלגןגנגעגףגץגצגקגשגתג‏דבדגדהדחדךדלדסדעדקדרדÿהבהדהןהץהצהקהתה‎ואובודוווזוטוךוכוםומוןוףופוצוקושו‎ו‏וÿזגזדזלזןזנזצז‏חבחדחזחחחעחצחרחתח‎ח‏חÿטאטבטגטדטוטזטטטיטלטמטןטףטפטץטקטרטשט‎ט‏טÿידיויחיכימיןיניפיץיצירךהךזךחךקךרכבכדכזכחכלכםכןכעכץכקכרכשלגלדלןלעלץלרלשל‎ל‏םבםגםזםחםכםנםפםץםקםשם‎ם‏םÿמאמגמדמומזמטמימכמלמםמממןמףמפמץמצמקמרמשמ‎מ‏מÿןלןסןעןפןרנחנפנץנשסבסדסהסזסחספסץסצסקסרסשסתס‎ס‏עדעהעחעלעןעפעץעצערעשעתע‎ףאףבףגףדףהףוףזףחףטףיףךףםףמףןףנףסףעףףףפףץףצףקףרףשף‎ף‏ףÿפאפלפםפמפנפספעפקפûץהץנץ‎צאצגצלצמצףצûקגרגרלרןרנרסרערצר‏שנשü‎ג‎ד‎ה‎ח‎י‎ך‎ל‎ן‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿדÿהÿוÿזÿטÿיÿךÿםÿןÿנÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
    20 => 'אאאהאואזאטאמאןאפאצאקאשא‎א‏אÿואובודוזוחוןוףופוצוקושו‎ו‏טגטזטףטפטץטשט‎כבכגכדכהכזכחכךכככלכםכסכעכפכץכקכרכשכûכüלבלגלדלטלךלכלללםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםאםבםגםדםהםוםזםחםטםךםכםםםמםנםסםעםףםפםץםצםקםרםשםüם‎ם‏םÿמאמומזמחמטמממןמףמפמץמצמקמרמשמ‎מ‏מÿנבנגנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏נÿסאסבסגסדסהסזסחסטסכסלסםסןסנסססףספסץסצסקסרסשסתסûסüס‎ס‏סÿעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתע‎ע‏ףאףבףגףהףוףזףטףיףךףכףלףמףןףסףףףפףץףקףרףשף‎ףÿפכפלפםפנפספעפפפקפûקאקגקוקךקכקלקםקמקנקעקףקרקüûבûדûהûוûזûחûטûיûךûכûלûםûןûסûעûףûץûצûקûרûשûÿ',
    21 => 'אאאדאחאפאצאקאראשגבגגגדגהגוגזגחגטגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדודחדטדךדכדלדםדנדסדעדףדקדרדÿהאהבהגהדהההוהזהחהטהךהכהלהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿואובודוהוווזוחוטוךוכוןוסועוףופוץוצוקושו‎ו‏וÿטןטףטפטצטרט‎ךאךגךהךוךזךחךטךךךכךלךםךסךעךףךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüלבלגלדלךלכלםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםûםüם‎מטמממצמרמ‎מ‏מÿןוןטןךןכןלןםןןןסןעןףןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנûנÿסאסבסגסדסהסזסחסכסלסםסןסנסססףספסץסצסקסרסשסתסûסüס‎ס‏עבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏ףבףגףדףחףטףיףלףםףמףסףףףפףץףצףקףשף‎ףÿרארגרךרכרלרםרןרנרסרערףרצרקרüר‏‎ג‎ד‎ה‎ח‎י‎ם‎נ‎ס‎פ‎ץ‎ÿ',
    22 => 'אאאבאגאדאהאזאחאטאיאךאמאסאףאפאצאקאראשא‎גאגבגגגדגהגזגחגךגכגלגםגמגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿואובוזוטופוצוקורושו‎וÿטבטדטזטףטץטצטקטרטשט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרלבלגלדלולטלךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏לÿמאמבמהמומזמחמטמכמםמממןמסמעמףמפמץמצמקמרמשמ‎מ‏מÿףאףבףגףדףהףוףטףךףכףלףמףןףנףסףעףףףפףץףצףקףרףשף‎ףÿûבûגûהûזûחûטûךûכûםûנûסûעûףûץûצûקûרûשûÿ',
    23 => 'אאאבאחאמאןאףאפאצאקא‎גבגגגדגהגזגחגטגךגכגלגםגןגנגסגעגץגצגקגרגשגתגüג‏גÿואוזומוףופוצושו‏טבטהטזטחטמטןטףטפט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכףכפכץכקכרכשכûכüכ‏כÿלבלגלדלולטלךלכלללםלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏מאמבמגמדמהמומזמחמטמכמממנמסמעמףמפמץמצמרמשמ‎מ‏מÿנאנבנגנדנהנזנחנטנךנכנלנםנמנןנננסנענףנפנץנצנקנרנשנûנüנ‏נÿעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏ףאףוףחףטףיףךףמףףףפףצףקף‎רגרךרכרלרםרמרןרנרסרערצרקרüר‏üבüגüדüהüזüחüךüלüםüמüןüפüצüקüרüש',
    24 => 'אאאחאטאמאףאצא‎גבגגגדגהגזגחגךגכגלגםגמגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿואוזומוצושו‎טאטדטהטזטחטטטמטףטצטקט‎ךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכףכפכץכקכרכשכüלבלגלדלולךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםפםץםצםקםרםשםüם‎מאמהמזמחמטמממץמצמקמרמשמ‎מ‏מÿןוןךןכןלןםןןןסןעןףןפןצןקןרןûןüןÿנאנבנגנדנהנונזנחנךנכנלנםנמנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססעסףספסץסצסקסרסשסתסûסüס‎ס‏סÿעבעגעדעהעחעךעכעלעםעןעסעעעפעץעצעקערעשעתעüע‎ע‏עÿףגףדףהףזףחףטףךףםףמףןףףףפףץףצף‎ףÿצאצגצטצךצלצמצףקגקוקטקךקכקלקםקמקנקעקףקרקüüבüגüדüהüוüזüחüךüלüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏ס‏ץ‏צ‏ק‏ר‏ש‏‏',
    25 => 'אאאבאזאחאטאמאןאנאףאפאצאקאראשא‎ואוחוףוץוצושו‎ו‏וÿטאטבטדטהטזטחטטטמטנטסטףטפט‎ט‏טÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏םÿמאמגמהמומזמחמטמימךמכמםמממןמנמסמעמףמפמץמצמקמרמשמ‎מ‏מÿנאנבנגנדנהנזנחנךנכנלנםנמנןנננסנענףנפנץנצנקנרנשנûנüנ‏ףאףבףגףדףהףוףזףחףטףיףךףכףלףמףףףפףץףצףקףרף‎ףÿüבüגüדüהüוüזüחüטüךüלüםüמüןüסüעüפüצüקüרüשüÿ',
    26 => 'ואובוגודוווטויוםומוןועוףופוצוקושו‎ו‏וÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ן‏נ‏ס‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿדÿהÿוÿזÿטÿיÿךÿלÿןÿץÿצÿקÿרÿשÿ‏ÿÿ',
    27 => 'בבבגבדבהבזבחבלבסבעבץבצבקברבשבתב‏בÿגבגגגדגהגזגחגכגלגןגנגסגעגץגצגשגתגüג‏גÿדבדגדדדהדודחדךדלדסדעדףדקדרהבהדהההזהחהךהלהןהסהעהץהצהקהרהתהûהüה‎ה‏הÿואובוגודוווזוטויוךוכוםומוןונוסועוףופוצוקורושו‎ו‏וÿזבזגזכזלזןזנזסזףזצזקזüז‏חבחהחזחחחטחךחלחנחסחצחקחרחתחüח‎ח‏חÿטאטבטגטהטוטזטחטטטיטךטכטלטםטמטןטנטעטףטפטץטצטקטרטשט‎ט‏טÿיגידיויחיךיכיליםימיניסיפיץיציקירךהךזךחךךךלךסךעךצךקכבכגכדכזכחכככלכםכןכעכפכץכקכרכשכ‏לגלדלכלללםלנלעלפלץלצלרלשלüל‎ל‏םבםגםדםהםזםחםכםנםעםפםץםצםרםשם‎ןלןןןסןעןפןצןרןûנבנדנהנזנחנכנלנןנננסנענפנץנצנקנשסבסדסהסזסחסםסנססספסצסשסתס‎ס‏עבעדעהעחעלעןעעעפעץעצעקערעשעתע‎ע‏ףאףבףגףדףוףחףטףיףךףכףלףםףמףןףנףסףעףףףפףץףצףרףשף‎ף‏ףÿץדץהץךץלץןץנץסץףץרץ‎צטצךצלצמצףצûקגקלקנקעקרקüרלרןרנרסרערקר‏שאשםשמשנשüÿבÿדÿהÿוÿזÿחÿטÿיÿךÿכÿלÿםÿןÿנÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
    28 => 'בבבגבדבהבזבחבךבכבלבםבנבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿדבדגדדדהדחדךדכדלדםדנדסדעדקדרדÿהבהגהדהההזהחהטהךהכהלהםהןהנהעהףהץהצהקהתהûהüה‎ה‏הÿואובוווזוטוכוםומוףוץוצוקושו‎ו‏וÿזבזגזדזהזזזטזךזכזלזםזמזןזנזסזףזצזקזüז‏חבחדחהחזחחחכחלחנחסחעחצחקחרחתח‎ח‏טאטבטגטדטהטוטזטחטטטיטךטכטםטמטןטסטעטףטפטקטשט‎ט‏טÿךגךהךזךחךךךלךנךעךצךקךרלבלגלדלךלכלללםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמבמגמדמהמומזמחמטמימךמכמלמממןמסמףמפמץמצמקמרמשמ‎מ‏מÿןךןכןלןםןמןןןנןסןףןפןצןקןרןûןüןÿסגסדסהסוסזסחסכסלסםסןסנססספסץסצסקסרסשסתסüס‎ס‏עבעגעדעהעחעךעכעלעןעסעעעפעץעצעקערעשעתעüע‎ע‏עÿפופכפלפםפספעפפפקצגצךצלקגקךקכקלקםקנקעקרקüרגרךרכרלרםרןרנרסרערצרקרüר‏שםשמשנשü‏א‏ב‏ג‏ד‏ה‏ו‏ז‏י‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿהÿוÿזÿחÿטÿיÿכÿןÿסÿעÿצÿקÿרÿשÿÿ',
    29 => 'גבגגגדגהגזגחגךגכגםגןגסגעגףגץגצגקגרגשגתגûגüג‏גÿדאדבדגדדדהדחדטדךדכדלדםדנדסדעדףדקדרדÿהבהזהחהךהכהםהמהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿחאחבחגחדחהחזחחחךחכחלחםחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿיגידיהיויחיךילימיןיניעיץיציקירךהךוךזךךךכךלךםךעךצךקךרכבכגכדכהכזכחכךכםכמכןכסכעכפכץכקכרכשכûכ‏כÿלגלדלךלכלםלנלסלעלפלץלצלקלרלשלûלüל‎ל‏לÿםאםבםזםחםךםכםנםףםפםץםקםרםשםûםüם‎ם‏םÿןאןוןךןכןלןםןנןסןעןףןפןצןקןרןûןüןÿנבנדנהנזנךנלנןנננפנץנצנקנרנשנüנ‏נÿסאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססףספסצסקסרסשסתסûסüס‎ס‏סÿעבעגעדעהעחעכעלעןעסעעעפעץעצעקערעשעתעüע‎ע‏עÿפאפכפלפםפמפנפספעפףפקפûץגץדץהץוץטץךץכץלץןץנץסץעץףץרץ‎ÿבÿגÿדÿהÿוÿזÿחÿטÿיÿכÿלÿםÿןÿנÿסÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
    30 => 'אאאבאגאדאהאואזאחאטאיאךאכאלאמאןאסאעאףאפאץאצאקאראשא‎א‏אÿבבבדבהבזבחבלבנבסבעבץבצבקברבשבתבüב‏גאגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿדבדגדדדהדחדטדךדכדלדםדנדסדעדףדקדרדÿהבהגהדהההחהךהכהלהןהנהעהץהקהרהתהûה‎ה‏ואובוגודוהוווזוחוטויוךוכוםומוןונוסוףופוץוצוקורושו‎ו‏וÿזבזגזדזהזזזךזכזלזמזןזנזסזףזצזקזüז‏חבחגחהחחחךחכחלחנחסחעחצחקחרחתחüח‎ח‏חÿיגידיהיויחיךיכיםימיןיניסיעיפיץיציקירךהךזךחךךךכךלךנךעךצךקךרכאכבכגכדכהכזכחכךכלכםכמכןכסכעכףכפכץכקכרכשכûלבלגלדלכלללםלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏לÿםבםגםהםזםחםכםםםנםסםעםפםקםרםשם‎ם‏ןאןכןלןםןמןןןנןסןעןףןפןצןקןרןûןüןÿנבנגנדנהנזנחנכנלנננסנענפנץנצנקנרנשנ‏סבסגסדסהסזסחסכסלסםסןסנסססףספסץסצסקסרסשסתס‎עבעגעדעהעחעכעלעןענעעעפעץעצעקערעשעתעüע‎ע‏עÿץגץדץהץךץכץלץןץנץסץעץרץ‎צאצגצוצךצלצמצףצûקגקכקלקנקעקררגרורטרכרלרמרןרנרסרערצרקרüר‏שםשמשנשü‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ס‏ץ‏צ‏ק‏ר‏ש‏‏',
    31 => 'בבבגבדבהבובזבחבךבלבםבסבעבףבץבצבקברבשבתבûב‏בÿגבגגגדגהגזגחגלגןגנגעגץגצגקגשגתג‏דבדגדדדהדחדלדנדעדרדÿהבהגהדהההזהחהכהלהןהסהעהץהצהרהתה‎ואובודוווזוחוטויוכוםומוןונוסוףופוץוצוקושו‎ו‏וÿזגזדזהזזזכזלזמזןזנזסזצזקזüז‏חבחהחזחחחלחנחסחעחצחרחתח‎ח‏טאטבטגטדטהטוטזטטטיטךטכטלטמטןטנטסטעטףטפטץטרטשט‎ט‏טÿיגידיהיויחיכיליםימיןיניפיץיקירךגךהךזךחךךךלךנךעךצךקכבכגכדכהכוכזכחכככלכםכןכפכץכקכרכשכÿלגלדלללםלנלעלפלץלקלרל‎ל‏לÿםבםזםחםכםנםעםפםץםרם‎ןכןלןןןנןסןעןפןצןרןüןÿנבנגנדנזנחנןנננענפנץנצנרנשנüנ‏נÿסבסגסדסהסזסחסלסןסנססספסץסצסקסרסשסתס‎ס‏עבעדעהעחעכעלעןענעעעפעץעצעקערעשעתע‎ע‏עÿץגץדץהץוץךץלץמץנץסץףץרץ‎צגצלצמצףקגקכקלקנקעקררארגרלרמרןרנרסרערףרצרקרüר‏שמשנשü‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿגÿדÿהÿוÿזÿחÿטÿיÿךÿכÿםÿןÿנÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
    );
  $res=0;
  for($i=0;$i<strlen($s)-1;$i++)
  {
    $c1=$s[$i];
    if($c1<'א'||$c1>'ÿ') continue;
    $c2=$s[$i+1];
    if($c2<'א'||$c2>'ÿ') continue;
    $i1=ord($c1)-ord('א');
    if(strpos($a[$i1],$c2)!==false)
    {
      $res++;
      continue;
    }
    if($i>=strlen($s)-2) continue;
    $c3=$s[$i+2];
    if($c3<'א'||$c3>'ÿ') continue;
    $i2=ord($c2)-ord('א');
    if(strpos($a[$i2],$c3)!==false)
    {
      $res++;
      $i++;
      continue;
    }
    $l=0;
    $r=strlen($b[$i1])/2-1;
    while($l<=$r)
    {
      $c=$l+(($r-$l)>>1);
      $ca=$b[$i1][$c*2];
      $cb=$b[$i1][$c*2+1];
      if($ca==$c2&&$cb==$c3)
      {
        $res++;
        break;
      }
      if($ca<$c2||$ca==$c2&&$cb<$c3)
        $l=$c+1;
      else
        $r=$c-1;
    }
  }
  return $res;
}

function _charset_alt_win($s)
{
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=0x80&&$c<=0x9f)
      $s[$i]=chr($c-0x80+0xc0);
    else if($c>=0xa0&&$c<=0xaf)
      $s[$i]=chr($c-0xa0+0xe0);
    else if($c>=0xc0&&$c<=0xdf)
      $s[$i]=chr($c-0xc0+0x80);
    else if($c>=0xf0&&$c<=0xff)
      $s[$i]=chr($c-0xf0+0xa0);
  }
  return $s;
}

function _charset_koi_win($s)
{
  $kw = array(
    //00   01   02   03   04   05   06   07   08   09   0a    0b   0c    0d   0e   0f
    0x80, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,  139, 140,  141, 142, 143, //0x80 - 0x8f
     144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 0xbb, 156, 0xab, 158, 159, //0x90 - 0x9f
     160, 161, 162, 184, 164, 165, 166, 167, 168, 169, 170,  171, 172,  173, 174, 175, //0xa0 - 0xaf
     176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186,  187, 188,  189, 190, 191, //0xb0 - 0xbf
     254, 224, 225, 246, 228, 229, 244, 227, 245, 232, 233,  234, 235,  236, 237, 238, //0xc0 - 0xcf
     239, 255, 240, 241, 242, 243, 230, 226, 252, 251, 231,  248, 253,  249, 247, 250, //0xd0 - 0xdf
     222, 192, 193, 214, 196, 197, 212, 195, 213, 200, 201,  202, 203,  204, 205, 206, //0xe0 - 0xef
     207, 223, 208, 209, 210, 211, 198, 194, 220, 219, 199,  216, 221,  217, 215, 218  //0xf0 - 0xff
     );
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=128)
      $s[$i]=chr($kw[$c-128]);
  }
  return $s;
}

function _charset_utf8_win($s)
{
  $r='';
  $state=1;
  for ($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    switch($state)
    {
      case 1: //not a special symbol
        if($c<=127)
        {
          $r.=$s[$i];
        }
        else
        {
          if(($c>>5)==6)
          {
            $c1=$c;
            $state=2;
          }
          else
            $r.=chr(128);
        }
        break;
      case 2: //an utf-8 encoded symbol has been meet
        $new_c2=($c1&3)*64+($c&63);
        $new_c1=($c1>>2)&5;
        $new_i=$new_c1*256+$new_c2;
        switch($new_i)
        {
          case   1025: $out_c='¨'; break;
          case   1105: $out_c='¸'; break;
          case 0x00ab: $out_c='«'; break;
          case 0x00bb: $out_c='»'; break;
          default: $out_c=chr($new_i-848);
        }
        $r.=$out_c;
        $state=1;
        break;
    }
  }
  return $r;
}

function _charset_prepare($s)
{
  $r=0;
  $k=0;
  for($i=0;$i<strlen($s)&&$r<255;$i++)
  {
    $c=ord($s[$i]);
    if($c>=0x80)
    {
      $r++;
      $k=$i;
    }
  }
  return substr($s,0,$k+1);
}

function charset_win_lowercase($s)
{
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=0xc0&&$c<=0xdf)
      $s[$i]=chr($c+32);
    else if($s[$i]>='A'&&$s[$i]<='Z')
      $s[$i]=chr($c+32);
  }
  return $s;
}

function charset_x_win($s)
{
// returns a string converted from a best encoding (windows-1251 or koi-8r) to windows-1251
  $sa=_charset_prepare($s);
  $s1=charset_win_lowercase($sa);
  $r1='windows-1251';

  $c1=_charset_count_chars($s1);
  $b1=_charset_count_bad($s1);
  $p1=_charset_count_pairs($s1);
  $w1=$p1*32+$b1*64-$c1;

  $s2=charset_win_lowercase(_charset_koi_win($sa));
  $w2=-$c1; //Îסמבוםםמסעü ךמהטנמגךט koi-8r: עמע זו הטאןאחמם סטלגמכמג, קעמ ט הכÿ windows-1251
  if($w2<$w1)
  {
    $b2=_charset_count_bad($s2);
    $w2+=64*$b2;
    if($w2<$w1)
    {
      $p2=_charset_count_pairs($s2);
      $w2+=32*$p2;
      if($w2<$w1)
      {
        $r1='koi-8r';
        $w1=$w2;
      }
    }
  }

  $s2=charset_win_lowercase(_charset_utf8_win($sa));

  $c2=_charset_count_chars($s2);
  $w2=-$c2;
  if($w2<$w1)
  {
    $b2=_charset_count_bad($s2);
    $w2+=64*$b2;
    if($w2<$w1)
    {
      $p2=_charset_count_pairs($s2);
      $w2+=32*$p2;
      if($w2<$w1)
      {
        $r1='utf';
        $w1=$w2;
      }
    }
  }

  switch($r1)
  {
    case 'alt':
      return _charset_alt_win($s);
    case 'koi-8r':
      return _charset_koi_win($s);
    case 'utf':
      return _charset_utf8_win($s);
    default:
      return $s;
  }

  return $s;
}

?>